# UnableToCopyElementsFromFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CuttingFailures..::..UnableToCopyElementsFromFile Property
BuiltInFailures..::..CuttingFailures Class See Also
---
Unable to copy elements from file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToCopyElementsFromFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToCopyElementsFromFile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToCopyElementsFromFile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CuttingFailures Class
Autodesk.Revit.DB Namespace